## Plan Result (543: demo_backendappgateway - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 1 to change, 5 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
* Delete
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-bookings-api&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-notification-api&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-test-api&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-user-api&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-video-api&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw"
        name                              = "aks00-demo-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "demo"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/vh-bookings-api" -> null
          - ip_addresses = [
              - "10.51.79.250",
              - "10.51.95.250",
            ] -> null
          - name         = "vh-bookings-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/vh-notification-api" -> null
          - ip_addresses = [
              - "10.51.79.250",
              - "10.51.95.250",
            ] -> null
          - name         = "vh-notification-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/vh-test-api" -> null
          - ip_addresses = [
              - "10.51.79.250",
              - "10.51.95.250",
            ] -> null
          - name         = "vh-test-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/vh-user-api" -> null
          - ip_addresses = [
              - "10.51.79.250",
              - "10.51.95.250",
            ] -> null
          - name         = "vh-user-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/vh-video-api" -> null
          - ip_addresses = [
              - "10.51.79.250",
              - "10.51.95.250",
            ] -> null
          - name         = "vh-video-api" -> null
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/darts-api" -> null
          - name                                = "darts-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/darts-api" -> null
          - probe_name                          = "darts-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/darts-external-component-test-harness" -> null
          - name                                = "darts-external-component-test-harness" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/darts-external-component-test-harness" -> null
          - probe_name                          = "darts-external-component-test-harness" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/darts-gateway" -> null
          - name                                = "darts-gateway" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/darts-gateway" -> null
          - probe_name                          = "darts-gateway" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/darts-proxy" -> null
          - name                                = "darts-proxy" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/darts-proxy" -> null
          - probe_name                          = "darts-proxy" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/darts-stub-services" -> null
          - name                                = "darts-stub-services" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/darts-stub-services" -> null
          - probe_name                          = "darts-stub-services" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/dummy-app" -> null
          - name                                = "dummy-app" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/dummy-app" -> null
          - probe_name                          = "dummy-app" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/juror-api" -> null
          - name                                = "juror-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/juror-api" -> null
          - probe_name                          = "juror-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/juror-pnc" -> null
          - name                                = "juror-pnc" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/juror-pnc" -> null
          - probe_name                          = "juror-pnc" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/juror-scheduler-api" -> null
          - name                                = "juror-scheduler-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/juror-scheduler-api" -> null
          - probe_name                          = "juror-scheduler-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/juror-scheduler-execution" -> null
          - name                                = "juror-scheduler-execution" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/juror-scheduler-execution" -> null
          - probe_name                          = "juror-scheduler-execution" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/my-time-api" -> null
          - name                                = "my-time-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/my-time-api" -> null
          - probe_name                          = "my-time-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/opal-file-handler" -> null
          - name                                = "opal-file-handler" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/opal-file-handler" -> null
          - probe_name                          = "opal-file-handler" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/opal-fines-service" -> null
          - name                                = "opal-fines-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/opal-fines-service" -> null
          - probe_name                          = "opal-fines-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/opal-legacy-db-stub" -> null
          - name                                = "opal-legacy-db-stub" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/opal-legacy-db-stub" -> null
          - probe_name                          = "opal-legacy-db-stub" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/opal-user-service" -> null
          - name                                = "opal-user-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/probes/opal-user-service" -> null
          - probe_name                          = "opal-user-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c195

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

= (known after apply)
          + backend_address_pool_name   = "juror-api"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "juror-api"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "juror-api"
          + id                          = (known after apply)
          + name                        = "juror-api"
          + priority                    = 190
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "juror-pnc"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "juror-pnc"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "juror-pnc"
          + id                          = (known after apply)
          + name                        = "juror-pnc"
          + priority                    = 180
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "juror-scheduler-api"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "juror-scheduler-api"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "juror-scheduler-api"
          + id                          = (known after apply)
          + name                        = "juror-scheduler-api"
          + priority                    = 160
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "juror-scheduler-execution"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "juror-scheduler-execution"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "juror-scheduler-execution"
          + id                          = (known after apply)
          + name                        = "juror-scheduler-execution"
          + priority                    = 170
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "my-time-api"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "my-time-api"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "my-time-api"
          + id                          = (known after apply)
          + name                        = "my-time-api"
          + priority                    = 80
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "opal-file-handler"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "opal-file-handler"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "opal-file-handler"
          + id                          = (known after apply)
          + name                        = "opal-file-handler"
          + priority                    = 230
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "opal-fines-service"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "opal-fines-service"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "opal-fines-service"
          + id                          = (known after apply)
          + name                        = "opal-fines-service"
          + priority                    = 200
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "opal-legacy-db-stub"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "opal-legacy-db-stub"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "opal-legacy-db-stub"
          + id                          = (known after apply)
          + name                        = "opal-legacy-db-stub"
          + priority                    = 210
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "opal-user-service"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "opal-user-service"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "opal-user-service"
          + id                          = (known after apply)
          + name                        = "opal-user-service"
          + priority                    = 220
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "pre-api"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "pre-api"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "pre-api"
          + id                          = (known after apply)
          + name                        = "pre-api"
          + priority                    = 150
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "pre-portal"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "pre-portal"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "pre-portal"
          + id                          = (known after apply)
          + name                        = "pre-portal"
          + priority                    = 140
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ rewrite_rule_set {
            id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/vh-bookings-api"
          ~ name = "vh-bookings-api" -> "my-time-api"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/vh-notification-api"
          ~ name = "vh-notification-api" -> "darts-api"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/vh-test-api"
          ~ name = "vh-test-api" -> "darts-gateway"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/vh-user-api"
          ~ name = "vh-user-api" -> "darts-proxy"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/vh-video-api"
          ~ name = "vh-video-api" -> "darts-stub-services"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/my-time-api"
          ~ name = "my-time-api" -> "darts-external-component-test-harness"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/darts-api"
          ~ name = "darts-api" -> "pre-portal"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/darts-gateway"
          ~ name = "darts-gateway" -> "pre-api"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/darts-proxy"
          ~ name = "darts-proxy" -> "juror-scheduler-api"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/darts-stub-services"
          ~ name = "darts-stub-services" -> "juror-scheduler-execution"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/darts-external-component-test-harness"
          ~ name = "darts-external-component-test-harness" -> "juror-pnc"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/pre-portal"
          ~ name = "pre-portal" -> "juror-api"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/pre-api"
          ~ name = "pre-api" -> "opal-fines-service"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/juror-scheduler-api"
          ~ name = "juror-scheduler-api" -> "opal-legacy-db-stub"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/juror-scheduler-execution"
          ~ name = "juror-scheduler-execution" -> "opal-user-service"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/juror-pnc"
          ~ name = "juror-pnc" -> "opal-file-handler"
        }
      - rewrite_rule_set {
          - id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/juror-api" -> null
          - name = "juror-api" -> null
        }
      - rewrite_rule_set {
          - id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/opal-fines-service" -> null
          - name = "opal-fines-service" -> null
        }
      - rewrite_rule_set {
          - id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/opal-legacy-db-stub" -> null
          - name = "opal-legacy-db-stub" -> null
        }
      - rewrite_rule_set {
          - id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/opal-user-service" -> null
          - name = "opal-user-service" -> null
        }
      - rewrite_rule_set {
          - id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/rewriteRuleSets/opal-file-handler" -> null
          - name = "opal-file-handler" -> null
        }

      ~ ssl_policy {
          + min_protocol_version = "TLSv1_2"
            # (4 unchanged attributes hidden)
        }

        # (39 unchanged blocks hidden)
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-bookings-api"] will be destroyed
  # (because key ["vh-bookings-api"] is not in for_each map)
  - resource "azurerm_private_dns_a_record" "this" {
      - fqdn                = "vh-bookings-api.demo.platform.hmcts.net." -> null
      - id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/demo.platform.hmcts.net/A/vh-bookings-api" -> null
      - name                = "vh-bookings-api" -> null
      - records             = [
          - "10.51.96.132",
        ] -> null
      - resource_group_name = "core-infra-intsvc-rg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "demo.platform.hmcts.net" -> null
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-notification-api"] will be destroyed
  # (because key ["vh-notification-api"] is not in for_each map)
  - resource "azurerm_private_dns_a_record" "this" {
      - fqdn                = "vh-notification-api.demo.platform.hmcts.net." -> null
      - id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/demo.platform.hmcts.net/A/vh-notification-api" -> null
      - name                = "vh-notification-api" -> null
      - records             = [
          - "10.51.96.132",
        ] -> null
      - resource_group_name = "core-infra-intsvc-rg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "demo.platform.hmcts.net" -> null
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-test-api"] will be destroyed
  # (because key ["vh-test-api"] is not in for_each map)
  - resource "azurerm_private_dns_a_record" "this" {
      - fqdn                = "vh-test-api.demo.platform.hmcts.net." -> null
      - id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/demo.platform.hmcts.net/A/vh-test-api" -> null
      - name                = "vh-test-api" -> null
      - records             = [
          - "10.51.96.132",
        ] -> null
      - resource_group_name = "core-infra-intsvc-rg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "demo.platform.hmcts.net" -> null
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-user-api"] will be destroyed
  # (because key ["vh-user-api"] is not in for_each map)
  - resource "azurerm_private_dns_a_record" "this" {
      - fqdn                = "vh-user-api.demo.platform.hmcts.net." -> null
      - id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/demo.platform.hmcts.net/A/vh-user-api" -> null
      - name                = "vh-user-api" -> null
      - records             = [
          - "10.51.96.132",
        ] -> null
      - resource_group_name = "core-infra-intsvc-rg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "demo.platform.hmcts.net" -> null
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-video-api"] will be destroyed
  # (because key ["vh-video-api"] is not in for_each map)
  - resource "azurerm_private_dns_a_record" "this" {
      - fqdn                = "vh-video-api.demo.platform.hmcts.net." -> null
      - id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/demo.platform.hmcts.net/A/vh-video-api" -> null
      - name                = "vh-video-api" -> null
      - records             = [
          - "10.51.96.132",
        ] -> null
      - resource_group_name = "core-infra-intsvc-rg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "demo.platform.hmcts.net" -> null
    }

Plan: 0 to add, 1 to change, 5 to destroy.
```

</details>





## :warning: Errors

* add a label 543: demo_backendappgateway - TerraformPlanApply/destroy: POST https://api.github.com/repos/hmcts/sds-azure-platform/issues/947/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":947,"Program":"tfcmt","SHA1":"","Target":"543: demo_backendappgateway - TerraformPlanApply","Vars":{}} -->